microbuilder/LPC11U_LPC13U_CodeBase/src/boards/rf1ghznode/board_rf1ghznode.h
    #ifdef CFG_CHIBI
      #if !((CFG_CHIBI_SPIPORT == 0) || (CFG_CHIBI_SPIPORT == 1))
        #error "Invalid SPI port for CFG_CHIBI_SPIPORT"
      #endif
    #endif
/*=========================================================================*/


/*=========================================================================
    CC3000 WIFI MODULES
    -----------------------------------------------------------------------

    CFG_CC3000                     If defined, CC3000 support will be
                                   included during build.  Requires
                                   external HW
    -----------------------------------------------------------------------*/
    // #define CFG_CC3000
    #define CFG_CC3000_SPI_PORT         (1)
    #define CFG_CC3000_EN_PORT          (0)
    #define CFG_CC3000_EN_PIN           (14)
    #define CFG_CC3000_IRQ_PORT         (0)
    #define CFG_CC3000_IRQ_PIN          (16)
    #define CFG_CC3000_CS_PORT          (0)
    #define CFG_CC3000_CS_PIN           (17)
/*=========================================================================*/


/*=========================================================================
    PN532/NFC STACK
    -----------------------------------------------------------------------

    CFG_PN532                      If defined, the PN532/NFC stack will be
                                   included during build.  Requires
                                   external HW
    CFG_PN532_MEM_POOL_SIZE_BYTES  Size of the dynamic memory pool in bytes
                                   (used by pn532/mem_allocator/ when
                                   working with NDEF messages)
    -----------------------------------------------------------------------*/
    // #define CFG_PN532
    #define CFG_PN532_RSTPD_PORT                      (0)
    #define CFG_PN532_RSTPD_PIN                       (16)
    #define CFG_PN532_I2C_IRQPORT                     (0)
    #define CFG_PN532_I2C_IRQPIN                      (17)
    #define CFG_PN532_MEM_POOL_SIZE_BYTES             (512)
/*=========================================================================*/


/*=========================================================================
    RTC SUPPORT
    -----------------------------------------------------------------------

    CFG_RTC                     If defined, RTC support will be included.
                                Requires external HW.
    -----------------------------------------------------------------------*/
    // #define CFG_RTC

    #if defined(CFG_RTC) && !defined(CFG_ENABLE_I2C)
      #error "CFG_ENABLE_I2C must be defined with CFG_RTC"
    #endif
/*=========================================================================*/


/*=========================================================================
    STEPPER MOTOR SUPPORT
    -----------------------------------------------------------------------

    CFG_STEPPER                 If defined, basic stepper motor support
                                will be included.  Requires external HW.
    -----------------------------------------------------------------------*/
    // #define CFG_STEPPER
    #define CFG_STEPPER_TIMER32                       (0)
    #define CFG_STEPPER_IN1_PORT                      (0)
    #define CFG_STEPPER_IN1_PIN                       (8)
    #define CFG_STEPPER_IN2_PORT                      (0)
    #define CFG_STEPPER_IN2_PIN                       (9)
    #define CFG_STEPPER_IN3_PORT                      (0)
    #define CFG_STEPPER_IN3_PIN                       (14)
    #define CFG_STEPPER_IN4_PORT                      (0)
    #define CFG_STEPPER_IN4_PIN                       (13)
/*=========================================================================*/


/*=========================================================================
    USB

    CFG_USB_STRING_MANUFACTURER Manufacturer name that will appear in the
                                device descriptor during USB enumeration
    CFG_USB_STRING_PRODUCT      Product name that will appear in the
                                device descriptor during USB enumeration
    CFG_USB_VENDORID            16-bit USB vendor ID
    CFG_CDC                     Enable USB CDC support
    CFG_USB_HID_KEYBOARD        Enable USB HID keyboard emulation
    CFG_USB_HID_MOUSE           Enable USB HID mouse emulation for a five
                                button 'Windows' mouse with scroll wheels
    CFG_USB_HID_GENERIC         Enable USB HID Generic support for custom
                                in and out reports, with report size set
                                via CFG_USB_HID_GENERIC_REPORT_SIZE
    CFG_USB_MSC                 Enable USB Mass Storage support, pointing
                                to the SD card reader (requires mmc.c from
                                the FATFS drivers, but doesn't use FATFS)

    You can combine more than one USB class below and they will be
    automatically combined in a USB composite device within the limit of
    available USB endpoints.  The USB Product ID is calculated automatically
    based on the combination of classes defined below.

    NOTE: Windows requires the .inf file in '/core/usb' for CDC support
    -----------------------------------------------------------------------*/
    #ifdef CFG_ENABLE_USB
      #define CFG_USB_STRING_MANUFACTURER   "microBuilder.eu"
      #define CFG_USB_STRING_PRODUCT        "RF1GHZNODE"
      #define CFG_USB_VENDORID              (0x1FC9)

      #define CFG_USB_CDC

      // #define CFG_USB_HID_KEYBOARD
      // #define CFG_USB_HID_MOUSE
      // #define CFG_USB_HID_GENERIC
      // #define CFG_USB_HID_GENERIC_REPORT_SIZE (64)

      // #define CFG_USB_MSC

      // #define CFG_USB_CUSTOM_CLASS

      #if (defined(CFG_USB_CDC)       || defined(CFG_USB_HID_KEYBOARD) || \
           defined(CFG_USB_HID_MOUSE) || defined(CFG_USB_HID_GENERIC)  || \
           defined(CFG_USB_MSC)       || defined(CFG_USB_CUSTOM_CLASS))
        #define CFG_USB
        #if defined(CFG_USB_HID_KEYBOARD) || defined(CFG_USB_HID_MOUSE) || defined(CFG_USB_HID_GENERIC)
          #define CFG_USB_HID
          #if defined(CFG_USB_HID_GENERIC) && (CFG_USB_HID_GENERIC_REPORT_SIZE > 64)
            #error "CFG_USB_HID_GENERIC_REPORT_SIZE exceeds the maximum value of 64 bytes (based on USB specs 2.0 for 'Full Speed Interrupt Endpoint Size')"
          #endif
        #endif
      #endif
    #endif
/*=========================================================================*/


/*=========================================================================
    CONFIG FILE VALIDATION

    Basic error checking to make sure that incompatible defines are not
    enabled at the same time, etc.

    -----------------------------------------------------------------------*/
    #if defined(CFG_INTERFACE) && !( defined CFG_PRINTF_UART || defined CFG_PRINTF_USBCDC || defined CFG_PRINTF_DEBUG)
      #error "At least one CFG_PRINTF target must be defined with CFG_INTERFACE"
    #endif

    #if defined(CFG_PRINTF_UART) && !defined(CFG_ENABLE_UART)
      #error "CFG_ENABLE_UART must be enabled with CFG_PRINTF_UART"
    #endif

    #if defined(CFG_PRINTF_USBCDC) && !defined(CFG_USB_CDC)
      #error "CFG_USB_CDC must be defined with CFG_PRINTF_USBCDC"
    #endif

    #if defined(CFG_USB_MSC) && !defined(CFG_SDCARD)
      #error "CFG_USB_MSC must be defined with CFG_SDCARD"
    #endif

    #if defined(CFG_PROTOCOL)
      #if defined(CFG_PROTOCOL_VIA_HID) && !defined(CFG_USB_HID_GENERIC)
        #error "CFG_PROTOCOL_VIA_HID requires CFG_USB_HID_GENERIC"
      #endif

      #if defined(CFG_PROTOCOL_VIA_BULK) && !defined(CFG_USB_CUSTOM_CLASS)
        #error "CFG_PROTOCOL_VIA_BULK requires CFG_USB_CUSTOM_CLASS to be defined"
      #endif
    #endif
/*=========================================================================*/

void     boardSetVREG3V3 ( void );
void     boardSetVREG2V2 ( void );
uint32_t boardGetVIN ( void );

#ifdef __cplusplus
}
#endif

#endif
